var ecoApp = angular.module('ecoApp', ['ngTouch', 'ngRoute','ngLocale','ui.bootstrap']);

ecoApp.controller  ('Ctrl',['$window', '$scope', '$http', function($window, $scope, $http) {

	$scope.problems = [
		{"title":"Загрязнение Днепра", 
		"content":"В городе Берислав нет очистных сооружений.", 
		"lat":46.832599917725325, 
		"lon":33.41646194458008, 
		"moderation":null,  
		"probType":"Проблеми водойм", 
		"probStatus":"Нова", 
		"severity":4, 
		"created":1393521893453, 
		"votes":14, 
		"_id":0}, 
		 
		 {"title":"kjh", 
		"content":"lklk", 
		"lat":50.42601852427907, 
		"lon":30.772705078125, 
		"moderation":null, 
		"probType":"Проблеми водойм", 
		"probStatus":"Нова", 
		"severity":2, 
		"created":1393521893453, 
		"votes":0, 
		"_id":1}, 
		 
		 {"title":"gjg", 
		"content":"ghjghjghj", 
		"lat":50.65990836093937, 
		"lon":29.871826171875, 
		"moderation":null, 
		"probType":"Проблеми лісів", 
		"probStatus":"Нова", 
		"severity":3, 
		"created":1407423033563, 
		"votes":0, 
		"_id":2},
		 
		 {"_id":3, 
		"content":"Біля 50 років тому ", 
		"created": 1392714951907, 
		"lat":45.35016680356678, 
		"lon":29.001090999227017, 
		"moderation":null, 
		"probStatus":"Вирішена", 
		"probType":"Проблеми водойм", 
		"severity":3, 
		"title":"Відновлення острова Малий Татару", 
		"votes":13}, 
		 
		 {"title":"Утилизация перерабатываемых отходов", 
		"content":"Пластик, стекло, метал - материалы, которые в наше время в большинстве стран подвергаются вторичной переработке.В нашей стране очень малая часть мусора сдается на вторпереработку. Это вредит почве, занимает полезные территории, которые могли бы быть использованы в других целях.Законодательно ввести систему сортировки бытовых и промышленных отходов. Организовать прием пластиковых бутылок в крупных магазинах.", 
		"lat":null, 
		"lon":null, 
		"moderation":null, 
		"probType":"Сміттєзвалища", 
		"probStatus":"Нова", 
		"severity":3, 
		"created": 1396979560049, 
		"votes":0, 
		"_id":7}, 
		 
		 {"title":"Гибель  Куяльницкого лимана ", 
		"content":" С 1975 года зеркальная площадь лимана уменьшилась с 28 до 16 квадратных километров, а объем воды в лимане убавился на 15 миллионов кубических метров. Загрязнение вод лимана различными удобрениями. Выполнение региональной программы по спасению Куяльницкого лимана, в которой четко отражены все проблемы и указаны пути её решения, в том числе: оздоровление пересыхающей реки Большой Куяльник путём ликвидации  искусственных водоемов, вырытых в бассейне реки (их число за последние 20 лет утроилось. Сегодня их — свыше 140.), Необходимо, в первую очередь, расчистить русла реки и восстановить сток. Установить водоохранные знаки вокруг лимана, речек, балок. Обустроить прибрежные защитные полосы. Запретить всякого рода копанки, карьеры, выпас худобы. ", 
		"lat":null, 
		"lon":null, 
		"moderation":null, 
		"probType":"Проблеми водойм", 
		"probStatus":"Нова", 
		"severity":3, 
		"created":1397064702923, 
		"votes":0, 
		"_id":8},
		 
		 {"title":"забор", 
		"content":"забор стоит за красной линией прямо на тротуаре, человек незаконно присвоил себе общую территорию в свою собственность.знести", 
		"lat":50.451807025972826, 
		"lon":30.670563876628876, 
		"moderation":null, 
		"probType":"Незаконна забудова", 
		"probStatus":"Нова", 
		"severity":3, 
		"created":1397064702923, 
		"votes":22, 
		"_id":9},
		 
		 {"_id":10, 
		"content":"Пам'ятка природи являє собою ботанічний феномен – зелений тунель у лісовому масиві, утворений заростями дерев та кущів, що сплелися між собою та утворили тунель точної арочної форми. Розташований на 4-кілометровому відрізку залізничної колії. Є місцевою туристичною принадою. Існують проблеми із прибиранням навколишньої території. На початку листопада 2013 року надійшла інформація про вирубку дерев навколо «Тунелю кохання» у шаховому порядку. Місцеві жителі періодично проводять толоки, прибирають тунель, проте існує проблема із зникненням обладнаних урн для сміття. Мешканці звернулися до мас-медіа, таких як Zik, Українська правда, 1+1. На запит журналістів заступник Рівненської ОДА О. Губанов пояснив ситуацію профілактичними роботами на залізничній гілці та впорядкуванням лісу. Кілька дерев дійсно були зрубані, однак так і залишилися лежати біля колій.   Проте після того, як подія набула розголосу в ЗМІ, вирубка дерев припинилася. Місцеві жителі досить ініціативні щодо захисту ботанічної пам’ятки, позаяк її відвідує багато туристів, в тому числі іноземних, що є джерелом прибутку. \n1.Туризм може стати джерелом фінансування робіт щодо догляду за лісом (добровільні пожертви, невеличкий збір).\n2. Можна запропонувати також надання тунелю статусу об’єкту культурної спадщини (ландшафтного, природно-антропогенного) із застосуванням відповідного режиму охорони. \n", 
		"created":1397074788948, 
		"lat":50.753943311892456, 
		"lon":26.01390838623047, 
		"moderation":null, 
		"probStatus":"Нова", 
		"probType":"Проблеми лісів", 
		"severity":3, 
		"title":"Необхідність збереження пам’ятки природи місцевого значення «Тунель кохання», с. Клевань, Рівненський район Рівненської області.", 
		"votes":23},
		 
		 {"_id":11,
		"content":"Щороку сюди припливає на зимовку велика кількість азовок, білобочок та афалін, оскільки там досить спокійно та є хороша кормова база, що дозволяє дельфінам збільшувати поголів’я та комфортно зимувати. Наразі дельфіни потерпають від риболовецьких сітей, заковтують пластикові пляшки та інше побутове сміття. Потрібне надання цим водам статусу охоронної території, де буде заборонена господарська діяльність. \nПротягом кількох років на мисі Айя функціонував екологічний пост, який не пускав туди туристів. Збільшилася кількість водоплавних птахів і комах, природа почала оживати. Рада громадських екологічних організацій Севастополя звертається до Мінекології із клопотанням щодо створення окремого морського заказника. Можливе також розширення території існуючого морського заказника - прибережного аквального комплексу біля мису Айя. \n", 
		"created":1393533447332, 
		"lat":44.47936052641368, 
		"lon":33.60065460205078, 
		"moderation":null, 
		"probStatus":"Нова", 
		"probType":"Загрози біорізноманіттю", 
		"severity":3, 
		"title":"Необхідність створення заказника для дельфінів біля мису Айя, Сарич та узбережжя Балаклави. ", 
		"votes":24}, 
		 
		 {"title":"Місцевість дуже забруднена,  місто потерпає від сміття", 
		"content":"", 
		"lat":47.65428791076271, 
		"lon":34.59869384765625, 
		"moderation":null, 
		"probType":"Сміттєзвалища", 
		"probStatus":"Нова", 
		"severity":3, 
		"created":1393542933610, 
		"votes":9, 
		"_id":12}, 
		 
		 {"title":"Высыхание Куяльницкого лимана", 
		"content":"\nУникальный Куяльницкий лиман в Одесской области находится на грани высыхания.\nНа восстановление водно-солевого баланса лимана необходимо порядка 100 млн грн.Пока было решено проложить трубопровод, который соединит море и лиман. Но строительные работы по прокладке трубопровода начнутся не раньше второй половины 2014 года.\nОб этом сообщил заместитель главы Одесской областной госадминистрации Олег Кураков.\nТак, по словам чиновника, в настоящее время только разрабатывается проектная документация для будущего строительства, и уже сейчас возник ряд проблем, связанных с прокладкой трубопровода через Николаевскую и Объездную дороги.", 
		"lat":null, 
		"lon":null, 
		"moderation":null, 
		"probType":"Проблеми водойм", 
		"probStatus":"Нова", 
		"severity":3, 
		"created":1393760713438, 
		"votes":0, 
		"_id":13},
		 
		 {"title":"Знакає річка", 
		"content":"Річка Мала Тернівка - колись гарна й мальовнича ріка. Нині вона під загрозою висихання та замулення. 15 років тому вона була повноводною і стрімкою. Зараз вона майже зникла, подекуди  її русла узагалі невидно. Проблема почалася у радянські часи, коли непродумане випасання овець знищило грунтовий покрив у деяких місцях і оголило глину, яку з дощами змиває у русло, деякі круті береги також знищені, на мілині що утворилась розрісся надмірний очерет. Тепер ситуацію погіршує глобальне потепління.1. Очищення русла від мулу. (дорого звісно, але річка доведена до того, що втратила здатність до самоочищення)\n2. Насадження рослинності", 
		"lat":48.71135334495093, 
		"lon":35.963144302368164, 
		"moderation":null, 
		"probType":"Проблеми водойм", 
		"probStatus":"Нова", 
		"severity":3, 
		"created":1393852187222, 
		"votes":10, 
		"_id":14}, 
		 
		 {"title":"Гніванський ліс", 
		"content":"Гніванське ліснитство в районі ЖБК просто потопає у смітті!!!Організувати акцію по прибиранню цієї території", 
		"lat":49.090871487866664, 
		"lon":28.34846019744873, 
		"moderation":null, 
		"probType":"Проблеми лісів", 
		"probStatus":"Нова", 
		"severity":3, 
		"created":1393852513527, 
		"votes":6, 
		"_id":15}, 
		 
		 {"title":"Загрози біорізноманіттю", 
		"content":"У Чернігівській обл.,  ТОВ «Земля і воля»,  а також багато інших с/господарств по всій Україні використовують гмо-культури (з паралельним використанням агресивної с/г хімії),  давно вже не в цілях \"проби\". Заборонити в Україні діяльність Монсанто,  Сингента та інших компаній,  що використовують ГМО-технології. \nЗаборонити використання ГМ-насіння і технологій у великому с \\ г та приватному фермерстві. \nЗробити Україну \"зоною,  вільною від ГМО\". \nРозробку на впровадження програми провести у 2014р.\n", 
		"lat":50.72167742756547, 
		"lon":31.46484375, 
		"moderation":null, 
		"probType":"Загрози біорізноманіттю", 
		"probStatus":"Нова", 
		"severity":3, 
		"created":1393857123621, 
		"votes":3, 
		"_id":16},
		 
		 {"title":"Загрози біорізноманіттю", 
		"content":"У Чернігівській обл.,  ТОВ «Земля і воля»,  а також багато інших с/господарств по всій Україні використовують гмо-культури (з паралельним використанням агресивної с/г хімії),  давно вже не в цілях \"проби\". Заборонити в Україні діяльність Монсанто,  Сингента та інших компаній,  що використовують ГМО-технології. \nЗаборонити використання ГМ-насіння і технологій у великому с \\ г та приватному фермерстві. \nЗробити Україну \"зоною,  вільною від ГМО\". \nРозробку на впровадження програми провести у 2014р.", 
		"lat":50.72254683363223, 
		"lon":31.4813232421875, 
		"moderation":null, 
		"probType":"Загрози біорізноманіттю", 
		"probStatus":"Нова", 
		"severity":3, 
		"created":1393857322232, 
		"votes":3, 
		"_id":17}, 
		 
		 {"title":"ГМО", 
		"content":"У Чернігівській обл.,  ТОВ «Земля і воля»,  а також багато інших с/господарств по всій Україні використовують гмо-культури (з паралельним використанням агресивної с/г хімії),  давно вже не в цілях \"проби\". Заборонити в Україні діяльність Монсанто,  Сингента та інших компаній,  що використовують ГМО-технології. \nЗаборонити використання ГМ-насіння і технологій у великому с \\ г та приватному фермерстві. \nЗробити Україну \"зоною,  вільною від ГМО\". \nРозробку на впровадження програми провести у 2014р.", 
		"lat":50.729501501474324, 
		"lon":31.47857666015625, 
		"moderation":null, 
		"probType":"Загрози біорізноманіттю", 
		"probStatus":"Нова", 
		"severity":3, 
		"created":1393857548298, 
		"votes":3, 
		"_id":18}, 
		 
		 {"title":"Сміттєзвалище біля Гмирі 6", 
		"content":"Велика територія бруду,  пластику та іншого сміття. Також по всьому мікрорайону собачі віпорожнення.Прибрати. Щось вирішити з незайманою територією: чи паркінг зробити (автомобілів тьма тьмуща),  чи сквер,  чи спортивний майданчик повноцінний (в мікрорайоні тільки дитячі майданчики),  чи баскетбольне поле.", 
		"lat":null, 
		"lon":null, 
		"moderation":null, 
		"probType":"Сміттєзвалища", 
		"probStatus":"Нова", 
		"severity":3, 
		"created":1393863083509, 
		"votes":0, 
		"_id":19}, 
		 
		 {"title":"Сміттєзвалище", 
		"content":"Несанкціоноване та хаотичне викидання сміття в лісосмугах та полях,  що псує загальний вигляд та шкодить довкіллю. Велика кількість будматеріалів та різного пластикового сміття.Організувати прибирання,  повідомлення особам відповідальним за екологічний стан в місцевості задля подальшого недопускання викидання там сміття!", 
		"lat":50.29054567769426, 
		"lon":30.796480178833008, 
		"moderation":null, 
		"probType":"Сміттєзвалища", 
		"probStatus":"Нова", 
		"severity":3, 
		"created":1394132350731, 
		"votes":2, 
		"_id":20}, 
		 
		 {"title":"Загроза втрати біорізноманіття акваторії навколо Тарханкутського півострова", 
		"content":"Незаконні методи вилову риби,  вилучення з природного середовища малих китоподібних,  надмірне рекреаційне навантаженняАкваторії потрібно включити до складу національного природного парку \"Чарівна гавань\"\n", 
		"lat":45.41423796852593, 
		"lon":32.491722106933594, 
		"moderation":null, 
		"probType":"Загрози біорізноманіттю", 
		"probStatus":"Нова", 
		"severity":3, 
		"created":1394140847363, 
		"votes":17, 
		"_id":21}, 
		 
		 {"_id":22, 
		"content":"Стехійні сміттєзвалища біля і в лісі.Поставити в с.Пожарки контейнери для роздільного збору сміття.", 
		"created":1393799139546, 
		"lat":49.95121990866206, 
		"lon":30.355224609375, 
		"moderation":null, 
		"probStatus":"Нова", 
		"probType":"Сміттєзвалища", 
		"severity":3, 
		"title":"с.Пожарки", 
		"votes":5}, 
		 
		 {"title":"НЕЗАКОНЕ СМІТТЄЗВАЛИЩЕ ОРГАНІЗОВАНЕ СІЛЬСЬКОЮ РАДОЮ", 
		"content":"В селі Богданнівка,  сільський голова організував майже в центрі села незаконне сміттєзвалищеПривернути увагу до данної проблеми жителів села і знайти рішення даної проблеми.", 
		"lat":50.61988638366742, 
		"lon":30.910093188285828, 
		"moderation":null, 
		"probType":"Сміттєзвалища", 
		"probStatus":"Нова", 
		"severity":3, 
		"created":2394544498121, 
		"votes":13, 
		"_id":23} 		
	];

	$scope.infoVisible = false;

	$scope.v_DeatiledProblemInfo = true;
	$scope.checked = true;// enter in edit mode
	var data = [];

	$scope.init = function(){
		if ($scope.problems == undefined) { 
			$scope.blockVisible = false;
			return
		} else {
			$scope.blockVisible = true;
			$scope.problemId = 0;
		}

		var i = 0;
		var newarray = new Array();
		var tempProblem = {};
		var last = $scope.problems.length;
		for (i = 0; i<last-1; i++) {
			for(var j = i+1; j < last; j++) {
				if($scope.problems[i].created < $scope.problems[j].created) {
					tempProblem.id = 		$scope.problems[i]._id;
					tempProblem.title =		$scope.problems[i].title;
					tempProblem.created = 	$scope.problems[i].created;
					$scope.problems[i].created = 	$scope.problems[j].created;
					$scope.problems[i].title = 		$scope.problems[j].title;
					$scope.problems[i]._id = 		$scope.problems[j]._id;
					$scope.problems[j]._id = 		tempProblem.id;
					$scope.problems[j].title =		tempProblem.title;
					$scope.problems[j].created = 	tempProblem.created;
				}
			}
			//console.log($scope.problems[i].created + "   " + $scope.problems[i].title + "   " + $scope.problems[i]._id) ;
			newarray.push(($scope.problems[i]));
		}
		$scope.infoVisible = true;
		$scope.statusButton();
		//$scope.RatingCrtl();

		
	}

	// startRating
	$scope.RatingCtrl = function ($scope) {
			$scope.rate = $scope.problems[$scope.problemId].severity;
			$scope.max = 5;
			$scope.isReadonly = false;

			$scope.hoveringOver = function(value) {
				$scope.overStar = value;
			};
			$scope.ratingStates = [
				{stateOn: 'glyphicon-star', stateOff: 'glyphicon-star-empty'}
			];
	};

	// filter same Date
	$scope.compareDate = function(index) {
		var datePrev = '';
		var dateNext = new Date($scope.problems[index].created);

		try { 
			datePrev = new Date($scope.problems[index-1].created);
			var dayPrev 	= datePrev.getDate();
			var monthPrev 	= datePrev.getMonth();
			var yearPrev 	= datePrev.getFullYear();
		}
		catch(err) {
    		datePrev = undefined;
		}

		var dayNext 	= dateNext.getDate();
		var monthNext 	= dateNext.getMonth();
		var yearNext 	= dateNext.getFullYear();

		//console.log( dayNext - dayPrev );
		if( (dayNext - dayPrev == 0) && (monthNext - monthPrev == 0) && (yearNext - yearPrev == 0) ) {
			$scope.changeMargin = 'b-problem-list-item-true';
			return true;
		} else {
			$scope.changeMargin = 'b-problem-list-item-false ';
			return false;
		}
	}


//problem info
	$scope.getDeatiledProblemInfo = function(problemId){
		$scope.v_DeatiledProblemInfo = $scope.v_DeatiledProblemInfo;//прибрав !
		$scope.problemId = problemId;
		$scope.RatingCtrl();
	};

//change status
	$scope.statusButton = function () {
  		$scope.singleModel = 1;
		$scope.radioModel = 'Middle';
		$scope.checkModel = {
		    middle: true,
		    right: false
		};
	};

//enable edit
	$scope.editMode = function(editMode){
		$scope.checked = !$scope.checked;
		if (!$scope.checked) {
			 $scope.title = tempTitle;
		} else {
			$scope.problems[tempId].title = tempTitle;
		}
	}	

//on Change
	$scope.onChange = function(){
		tempTitle = $scope.title;
	}

	$scope.onBlur = function(){
		$scope.problems[tempId].title = tempTitle;
		$scope.checked = !$scope.checked;
	}


}]);

/*
[
		{"title":"Загрязнение Днепра", 
		"content":"В городе Берислав нет очистных сооружений.", 
		"lat":46.832599917725325, 
		"lon":33.41646194458008, 
		"moderation":null,  
		"probType":"Проблеми водойм", 
		"probStatus":"Нова", 
		"severity":3, 
		"created":1393521893453, 
		"votes":14, 
		"_id":0}, 
		 
		 {"title":"kjh", 
		"content":"lklk", 
		"lat":50.42601852427907, 
		"lon":30.772705078125, 
		"moderation":null, 
		"probType":"Проблеми водойм", 
		"probStatus":"Нова", 
		"severity":3, 
		"created":1393521893453, 
		"votes":0, 
		"_id":1}, 
		 
		 {"title":"gjg", 
		"content":"ghjghjghj", 
		"lat":50.65990836093937, 
		"lon":29.871826171875, 
		"moderation":null, 
		"probType":"Проблеми лісів", 
		"probStatus":"Нова", 
		"severity":3, 
		"created":1407423033563, 
		"votes":0, 
		"_id":2},
		 
		 {"_id":3, 
		"content":"Біля 50 років тому ", 
		"created": 1392714951907, 
		"lat":45.35016680356678, 
		"lon":29.001090999227017, 
		"moderation":null, 
		"probStatus":"Вирішена", 
		"probType":"Проблеми водойм", 
		"severity":3, 
		"title":"Відновлення острова Малий Татару", 
		"votes":13}, 
		 
		 {"title":"Утилизация перерабатываемых отходов", 
		"content":"Пластик, стекло, метал - материалы, которые в наше время в большинстве стран подвергаются вторичной переработке.В нашей стране очень малая часть мусора сдается на вторпереработку. Это вредит почве, занимает полезные территории, которые могли бы быть использованы в других целях.Законодательно ввести систему сортировки бытовых и промышленных отходов. Организовать прием пластиковых бутылок в крупных магазинах.", 
		"lat":null, 
		"lon":null, 
		"moderation":null, 
		"probType":"Сміттєзвалища", 
		"probStatus":"Нова", 
		"severity":3, 
		"created": 1396979560049, 
		"votes":0, 
		"_id":7}, 
		 
		 {"title":"Гибель  Куяльницкого лимана ", 
		"content":" С 1975 года зеркальная площадь лимана уменьшилась с 28 до 16 квадратных километров, а объем воды в лимане убавился на 15 миллионов кубических метров. Загрязнение вод лимана различными удобрениями. Выполнение региональной программы по спасению Куяльницкого лимана, в которой четко отражены все проблемы и указаны пути её решения, в том числе: оздоровление пересыхающей реки Большой Куяльник путём ликвидации  искусственных водоемов, вырытых в бассейне реки (их число за последние 20 лет утроилось. Сегодня их — свыше 140.), Необходимо, в первую очередь, расчистить русла реки и восстановить сток. Установить водоохранные знаки вокруг лимана, речек, балок. Обустроить прибрежные защитные полосы. Запретить всякого рода копанки, карьеры, выпас худобы. ", 
		"lat":null, 
		"lon":null, 
		"moderation":null, 
		"probType":"Проблеми водойм", 
		"probStatus":"Нова", 
		"severity":3, 
		"created":1397064702923, 
		"votes":0, 
		"_id":8},
		 
		 {"title":"забор", 
		"content":"забор стоит за красной линией прямо на тротуаре, человек незаконно присвоил себе общую территорию в свою собственность.знести", 
		"lat":50.451807025972826, 
		"lon":30.670563876628876, 
		"moderation":null, 
		"probType":"Незаконна забудова", 
		"probStatus":"Нова", 
		"severity":3, 
		"created":1397064702923, 
		"votes":22, 
		"_id":9},
		 
		 {"_id":10, 
		"content":"Пам'ятка природи являє собою ботанічний феномен – зелений тунель у лісовому масиві, утворений заростями дерев та кущів, що сплелися між собою та утворили тунель точної арочної форми. Розташований на 4-кілометровому відрізку залізничної колії. Є місцевою туристичною принадою. Існують проблеми із прибиранням навколишньої території. На початку листопада 2013 року надійшла інформація про вирубку дерев навколо «Тунелю кохання» у шаховому порядку. Місцеві жителі періодично проводять толоки, прибирають тунель, проте існує проблема із зникненням обладнаних урн для сміття. Мешканці звернулися до мас-медіа, таких як Zik, Українська правда, 1+1. На запит журналістів заступник Рівненської ОДА О. Губанов пояснив ситуацію профілактичними роботами на залізничній гілці та впорядкуванням лісу. Кілька дерев дійсно були зрубані, однак так і залишилися лежати біля колій.   Проте після того, як подія набула розголосу в ЗМІ, вирубка дерев припинилася. Місцеві жителі досить ініціативні щодо захисту ботанічної пам’ятки, позаяк її відвідує багато туристів, в тому числі іноземних, що є джерелом прибутку. \n1.Туризм може стати джерелом фінансування робіт щодо догляду за лісом (добровільні пожертви, невеличкий збір).\n2. Можна запропонувати також надання тунелю статусу об’єкту культурної спадщини (ландшафтного, природно-антропогенного) із застосуванням відповідного режиму охорони. \n", 
		"created":1397074788948, 
		"lat":50.753943311892456, 
		"lon":26.01390838623047, 
		"moderation":null, 
		"probStatus":"Нова", 
		"probType":"Проблеми лісів", 
		"severity":3, 
		"title":"Необхідність збереження пам’ятки природи місцевого значення «Тунель кохання», с. Клевань, Рівненський район Рівненської області.", 
		"votes":23},
		 
		 {"_id":11,
		"content":"Щороку сюди припливає на зимовку велика кількість азовок, білобочок та афалін, оскільки там досить спокійно та є хороша кормова база, що дозволяє дельфінам збільшувати поголів’я та комфортно зимувати. Наразі дельфіни потерпають від риболовецьких сітей, заковтують пластикові пляшки та інше побутове сміття. Потрібне надання цим водам статусу охоронної території, де буде заборонена господарська діяльність. \nПротягом кількох років на мисі Айя функціонував екологічний пост, який не пускав туди туристів. Збільшилася кількість водоплавних птахів і комах, природа почала оживати. Рада громадських екологічних організацій Севастополя звертається до Мінекології із клопотанням щодо створення окремого морського заказника. Можливе також розширення території існуючого морського заказника - прибережного аквального комплексу біля мису Айя. \n", 
		"created":1393533447332, 
		"lat":44.47936052641368, 
		"lon":33.60065460205078, 
		"moderation":null, 
		"probStatus":"Нова", 
		"probType":"Загрози біорізноманіттю", 
		"severity":3, 
		"title":"Необхідність створення заказника для дельфінів біля мису Айя, Сарич та узбережжя Балаклави. ", 
		"votes":24}, 
		 
		 {"title":"Місцевість дуже забруднена,  місто потерпає від сміття", 
		"content":"", 
		"lat":47.65428791076271, 
		"lon":34.59869384765625, 
		"moderation":null, 
		"probType":"Сміттєзвалища", 
		"probStatus":"Нова", 
		"severity":3, 
		"created":1393542933610, 
		"votes":9, 
		"_id":12}, 
		 
		 {"title":"Высыхание Куяльницкого лимана", 
		"content":"\nУникальный Куяльницкий лиман в Одесской области находится на грани высыхания.\nНа восстановление водно-солевого баланса лимана необходимо порядка 100 млн грн.Пока было решено проложить трубопровод, который соединит море и лиман. Но строительные работы по прокладке трубопровода начнутся не раньше второй половины 2014 года.\nОб этом сообщил заместитель главы Одесской областной госадминистрации Олег Кураков.\nТак, по словам чиновника, в настоящее время только разрабатывается проектная документация для будущего строительства, и уже сейчас возник ряд проблем, связанных с прокладкой трубопровода через Николаевскую и Объездную дороги.", 
		"lat":null, 
		"lon":null, 
		"moderation":null, 
		"probType":"Проблеми водойм", 
		"probStatus":"Нова", 
		"severity":3, 
		"created":1393760713438, 
		"votes":0, 
		"_id":13},
		 
		 {"title":"Знакає річка", 
		"content":"Річка Мала Тернівка - колись гарна й мальовнича ріка. Нині вона під загрозою висихання та замулення. 15 років тому вона була повноводною і стрімкою. Зараз вона майже зникла, подекуди  її русла узагалі невидно. Проблема почалася у радянські часи, коли непродумане випасання овець знищило грунтовий покрив у деяких місцях і оголило глину, яку з дощами змиває у русло, деякі круті береги також знищені, на мілині що утворилась розрісся надмірний очерет. Тепер ситуацію погіршує глобальне потепління.1. Очищення русла від мулу. (дорого звісно, але річка доведена до того, що втратила здатність до самоочищення)\n2. Насадження рослинності", 
		"lat":48.71135334495093, 
		"lon":35.963144302368164, 
		"moderation":null, 
		"probType":"Проблеми водойм", 
		"probStatus":"Нова", 
		"severity":3, 
		"created":1393852187222, 
		"votes":10, 
		"_id":14}, 
		 
		 {"title":"Гніванський ліс", 
		"content":"Гніванське ліснитство в районі ЖБК просто потопає у смітті!!!Організувати акцію по прибиранню цієї території", 
		"lat":49.090871487866664, 
		"lon":28.34846019744873, 
		"moderation":null, 
		"probType":"Проблеми лісів", 
		"probStatus":"Нова", 
		"severity":3, 
		"created":1393852513527, 
		"votes":6, 
		"_id":15}, 
		 
		 {"title":"Загрози біорізноманіттю", 
		"content":"У Чернігівській обл.,  ТОВ «Земля і воля»,  а також багато інших с/господарств по всій Україні використовують гмо-культури (з паралельним використанням агресивної с/г хімії),  давно вже не в цілях \"проби\". Заборонити в Україні діяльність Монсанто,  Сингента та інших компаній,  що використовують ГМО-технології. \nЗаборонити використання ГМ-насіння і технологій у великому с \\ г та приватному фермерстві. \nЗробити Україну \"зоною,  вільною від ГМО\". \nРозробку на впровадження програми провести у 2014р.\n", 
		"lat":50.72167742756547, 
		"lon":31.46484375, 
		"moderation":null, 
		"probType":"Загрози біорізноманіттю", 
		"probStatus":"Нова", 
		"severity":3, 
		"created":1393857123621, 
		"votes":3, 
		"_id":16},
		 
		 {"title":"Загрози біорізноманіттю", 
		"content":"У Чернігівській обл.,  ТОВ «Земля і воля»,  а також багато інших с/господарств по всій Україні використовують гмо-культури (з паралельним використанням агресивної с/г хімії),  давно вже не в цілях \"проби\". Заборонити в Україні діяльність Монсанто,  Сингента та інших компаній,  що використовують ГМО-технології. \nЗаборонити використання ГМ-насіння і технологій у великому с \\ г та приватному фермерстві. \nЗробити Україну \"зоною,  вільною від ГМО\". \nРозробку на впровадження програми провести у 2014р.", 
		"lat":50.72254683363223, 
		"lon":31.4813232421875, 
		"moderation":null, 
		"probType":"Загрози біорізноманіттю", 
		"probStatus":"Нова", 
		"severity":3, 
		"created":1393857322232, 
		"votes":3, 
		"_id":17}, 
		 
		 {"title":"ГМО", 
		"content":"У Чернігівській обл.,  ТОВ «Земля і воля»,  а також багато інших с/господарств по всій Україні використовують гмо-культури (з паралельним використанням агресивної с/г хімії),  давно вже не в цілях \"проби\". Заборонити в Україні діяльність Монсанто,  Сингента та інших компаній,  що використовують ГМО-технології. \nЗаборонити використання ГМ-насіння і технологій у великому с \\ г та приватному фермерстві. \nЗробити Україну \"зоною,  вільною від ГМО\". \nРозробку на впровадження програми провести у 2014р.", 
		"lat":50.729501501474324, 
		"lon":31.47857666015625, 
		"moderation":null, 
		"probType":"Загрози біорізноманіттю", 
		"probStatus":"Нова", 
		"severity":3, 
		"created":1393857548298, 
		"votes":3, 
		"_id":18}, 
		 
		 {"title":"Сміттєзвалище біля Гмирі 6", 
		"content":"Велика територія бруду,  пластику та іншого сміття. Також по всьому мікрорайону собачі віпорожнення.Прибрати. Щось вирішити з незайманою територією: чи паркінг зробити (автомобілів тьма тьмуща),  чи сквер,  чи спортивний майданчик повноцінний (в мікрорайоні тільки дитячі майданчики),  чи баскетбольне поле.", 
		"lat":null, 
		"lon":null, 
		"moderation":null, 
		"probType":"Сміттєзвалища", 
		"probStatus":"Нова", 
		"severity":3, 
		"created":1393863083509, 
		"votes":0, 
		"_id":19}, 
		 
		 {"title":"Сміттєзвалище", 
		"content":"Несанкціоноване та хаотичне викидання сміття в лісосмугах та полях,  що псує загальний вигляд та шкодить довкіллю. Велика кількість будматеріалів та різного пластикового сміття.Організувати прибирання,  повідомлення особам відповідальним за екологічний стан в місцевості задля подальшого недопускання викидання там сміття!", 
		"lat":50.29054567769426, 
		"lon":30.796480178833008, 
		"moderation":null, 
		"probType":"Сміттєзвалища", 
		"probStatus":"Нова", 
		"severity":3, 
		"created":1394132350731, 
		"votes":2, 
		"_id":20}, 
		 
		 {"title":"Загроза втрати біорізноманіття акваторії навколо Тарханкутського півострова", 
		"content":"Незаконні методи вилову риби,  вилучення з природного середовища малих китоподібних,  надмірне рекреаційне навантаженняАкваторії потрібно включити до складу національного природного парку \"Чарівна гавань\"\n", 
		"lat":45.41423796852593, 
		"lon":32.491722106933594, 
		"moderation":null, 
		"probType":"Загрози біорізноманіттю", 
		"probStatus":"Нова", 
		"severity":3, 
		"created":1394140847363, 
		"votes":17, 
		"_id":21}, 
		 
		 {"_id":22, 
		"content":"Стехійні сміттєзвалища біля і в лісі.Поставити в с.Пожарки контейнери для роздільного збору сміття.", 
		"created":1393799139546, 
		"lat":49.95121990866206, 
		"lon":30.355224609375, 
		"moderation":null, 
		"probStatus":"Нова", 
		"probType":"Сміттєзвалища", 
		"severity":3, 
		"title":"с.Пожарки", 
		"votes":5}, 
		 
		 {"title":"НЕЗАКОНЕ СМІТТЄЗВАЛИЩЕ ОРГАНІЗОВАНЕ СІЛЬСЬКОЮ РАДОЮ", 
		"content":"В селі Богданнівка,  сільський голова організував майже в центрі села незаконне сміттєзвалищеПривернути увагу до данної проблеми жителів села і знайти рішення даної проблеми.", 
		"lat":50.61988638366742, 
		"lon":30.910093188285828, 
		"moderation":null, 
		"probType":"Сміттєзвалища", 
		"probStatus":"Нова", 
		"severity":3, 
		"created":1394544498121, 
		"votes":13, 
		"_id":23} 		
	]*/